





Network Working Group                                         Enke Chen
Internet Draft                                            Cisco Systems
Expiration Date: December 2005                           Vincent Gillet
                                                         France Telecom

              Subcodes for BGP Cease Notification Message

                  draft-ietf-idr-cease-subcode-06.txt


1. Status of this Memo

   By submitting this Internet-Draft, each author represents that any
   applicable patent or other IPR claims of which he or she is aware
   have been or will be disclosed, and any of which he or she becomes
   aware will be disclosed, in accordance with Section 6 of BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.


2. Abstract

   This document defines several subcodes for the BGP Cease NOTIFICATION
   message that would provide more information to aid network operators
   in correlating network events and diagnosing BGP peering issues.












Chen & Gillet                                                   [Page 1]





Internet Draft     draft-ietf-idr-cease-subcode-06.txt         June 2004


3. Specification of Requirements

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC 2119 [RFC-2119].


4. Introduction

   This document defines several subcodes for the BGP Cease NOTIFICATION
   message that would provide more information to aid network operators
   in correlating network events and diagnosing BGP peering issues.


5. Subcode Definition

   The following subcodes are defined for the Cease NOTIFICATION
   message:

      Subcode     Symbolic Name

         1        Maximum Number of Prefixes Reached
         2        Administrative Shutdown
         3        Peer De-configured
         4        Administrative Reset
         5        Connection Rejected
         6        Other Configuration Change
         7        Connection Collision Resolution
         8        Out of Resources


6. Subcode Usage

   If a BGP speaker decides to terminate its peering with a neighbor
   because the number of address prefixes received from the neighbor
   exceeds a locally configured upper bound (as described in [BGP-4]),
   then the speaker MUST send to the neighbor a NOTIFICATION message
   with the Error Code Cease, and the Error Subcode "Maximum Number of
   Prefixes Reached". The message MAY optionally include the Address
   Family information [BGP-MP] and the upper bound in the "Data" field
   as shown in Figure 1 where the meaning and use of the <AFI, SAFI>
   tuple is the same as defined in [BGP-MP, sect. 7].









Chen & Gillet                                                   [Page 2]





Internet Draft     draft-ietf-idr-cease-subcode-06.txt         June 2004


                  +-------------------------------+
                  | AFI (2 octets)                |
                  +-------------------------------+
                  | SAFI (1 octet)                |
                  +-------------------------------+
                  | Prefix upper bound (4 octets) |
                  +-------------------------------+

                     Figure 1 Optional Data Field


   If a BGP speaker decides to administratively shut down its peering
   with a neighbor, then the speaker SHOULD send a NOTIFICATION message
   with the Error Code Cease, and the Error Subcode "Administrative
   Shutdown".

   If a BGP speaker decides to de-configure a peer, then the speaker
   SHOULD send a NOTIFICATION message with the Error Code Cease, and the
   Error Subcode "Peer De-configured".

   If a BGP speaker decides to administratively reset the peering with a
   neighbor, then the speaker SHOULD send a NOTIFICATION message with
   the Error Code Cease, and the Error Subcode "Administrative Reset".

   If a BGP speaker decides to dis-allow a BGP connection (e.g., the
   peer is not configured locally) after the speaker accepts a transport
   protocol connection, then the BGP speaker SHOULD send a NOTIFICATION
   message with the Error Code Cease, and the Error Subcode "Connection
   Rejected".

   If a BGP speaker decides to administratively reset the peering with a
   neighbor due to a configuration change other than the ones described
   above, then the speaker SHOULD send a NOTIFICATION message with the
   Error Code Cease, and the Error Subcode "Other Configuration Change".

   If a BGP speaker decides to send a NOTIFICATION message with the
   Error Code Cease as a result of the collision resolution procedure
   (as described in [BGP-4]), then the subcode SHOULD be set to
   "Connection Collision Resolution".

   If a BGP speaker runs out of resources (e.g., memory) and decides to
   reset a session, then the speaker MAY send a NOTIFICATION message
   with the Error Code Cease, and the Error Subcode "Out of Resources".

   It is RECOMMENDED that a BGP speaker implement a backoff mechanism in
   re-trying a BGP connection after the speaker receives a Cease
   NOTIFICATION message with subcode of "Administrative Shutdown", or
   "Peer De-configured", or "Connection Rejected", or "Out of



Chen & Gillet                                                   [Page 3]





Internet Draft     draft-ietf-idr-cease-subcode-06.txt         June 2004


   Resources".  An implementation SHOULD impose an upper bound on the
   number of consecutive automatic retries. Once this bound is reached,
   the implementation would stop re-trying any BGP connections until
   some administrative intervention.


7. IANA Considerations

   This document defines the subcodes 1 - 8 for the BGP Cease
   NOTIFICATION message.  Future assignments are to be made using either
   the Standards Action process defined in [RFC-2434], or the Early IANA
   Allocation process defined in [kompella-zinin], or the "First Come
   First Served" policy defined in [RFC-2434].


8. Security Considerations

   This extension to BGP does not change the underlying security issues
   inherent in the existing BGP.


9. Acknowledgments

   The authors would like to thank Yakov Rekhter, Pedro Marques, Andrew
   Lange and Don Goodspeed for their review and suggestions.


10. Normative References

   [BGP-4] Y. Rekhter, T. Li and S. Hares, "A Border Gateway Protocol 4
   (BGP-4)", <draft-ietf-idr-bgp4-26.txt>, October 2004.

   [BGP-MP] Bates, T., Chandra, R., Katz, D. and Y. Rekhter,
   "Multiprotocol Extensions for BGP-4", RFC 2858, June 2000.

   [RFC-2434] Narten, T., Alvestrand, H., "Guidelines for Writing an
   IANA Considerations Section in RFCs", RFC 2434, October 1998.

   [RFC-2119] Bradner, S., "Key words for use in RFCs to Indicate
   Requirement Levels", BCP 14, RFC 2119, March 1997.











Chen & Gillet                                                   [Page 4]





Internet Draft     draft-ietf-idr-cease-subcode-06.txt         June 2004


11. Non-normative References

   [kompella-zinin] Kompella, K., Zinin, A., "Early IANA Allocation of
   Standards Track Codepoints", Work in progress


12. Author Information

   Enke Chen
   Cisco Systems, Inc.
   170 W. Tasman Dr.
   San Jose, CA 95134
   Email: enkechen@cisco.com

   Vincent Gillet
   France Telecom Longues Distances
   61, rue des Archives
   75003 Paris FRANCE
   Email: vgi@opentransit.net


13. Intellectual Property Considerations

   The IETF takes no position regarding the validity or scope of any
   Intellectual Property Rights or other rights that might be claimed to
   pertain to the implementation or use of the technology described in
   this document or the extent to which any license under such rights
   might or might not be available; nor does it represent that it has
   made any independent effort to identify any such rights.  Information
   on the procedures with respect to rights in RFC documents can be
   found in BCP 78 and BCP 79.

   Copies of IPR disclosures made to the IETF Secretariat and any
   assurances of licenses to be made available, or the result of an
   attempt made to obtain a general license or permission for the use of
   such proprietary rights by implementers or users of this
   specification can be obtained from the IETF on-line IPR repository at
   http://www.ietf.org/ipr.

   The IETF invites any interested party to bring to its attention any
   copyrights, patents or patent applications, or other proprietary
   rights that may cover technology that may be required to implement
   this standard.  Please address the information to the IETF at ietf-
   ipr@ietf.org.







Chen & Gillet                                                   [Page 5]





Internet Draft     draft-ietf-idr-cease-subcode-06.txt         June 2004


14. Full Copyright Notice

   Copyright (C) The Internet Society (2005).

   This document is subject to the rights, licenses and restrictions
   contained in BCP 78, and except as set forth therein, the authors
   retain all their rights.

   This document and the information contained herein are provided on an
   "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS
   OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET
   ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED,
   INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE
   INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED
   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.




































Chen & Gillet                                                   [Page 6]


